In [56]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array(mylist)

In [3]:
arr

array([10, 20, 30])

In [4]:
d = {'a':10, 'b':20, 'c':30}

In [5]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(data=arr, index=labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(data=[10, 'a', 3.5])

0     10
1      a
2    3.5
dtype: object

In [9]:
ser1 = pd.Series([1,2,3,4], index=['USA', "USSR", 'Germany','Japan'])

In [10]:
ser1['USA']

1

In [11]:
from numpy.random import randn
np.random.seed(42)

rand_mat = randn(5,4)
rand_mat

array([[ 0.49671415, -0.1382643 ,  0.64768854,  1.52302986],
       [-0.23415337, -0.23413696,  1.57921282,  0.76743473],
       [-0.46947439,  0.54256004, -0.46341769, -0.46572975],
       [ 0.24196227, -1.91328024, -1.72491783, -0.56228753],
       [-1.01283112,  0.31424733, -0.90802408, -1.4123037 ]])

In [12]:
df = pd.DataFrame(rand_mat, index= 'A B C D E'.split(), columns=' W X Y Z'.split())
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [13]:
df['W']

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
E   -1.012831
Name: W, dtype: float64

In [14]:
mylist = ['W', 'Y']
df[mylist]

          W         Y
A  0.496714  0.647689
B -0.234153  1.579213
C -0.469474 -0.463418
D  0.241962 -1.724918
E -1.012831 -0.908024

In [15]:
df[['Y', 'Z']]

          Y         Z
A  0.647689  1.523030
B  1.579213  0.767435
C -0.463418 -0.465730
D -1.724918 -0.562288
E -0.908024 -1.412304

In [16]:
df['New'] = df['W']+df['Y']
df

          W         X         Y         Z       New
A  0.496714 -0.138264  0.647689  1.523030  1.144403
B -0.234153 -0.234137  1.579213  0.767435  1.345059
C -0.469474  0.542560 -0.463418 -0.465730 -0.932892
D  0.241962 -1.913280 -1.724918 -0.562288 -1.482956
E -1.012831  0.314247 -0.908024 -1.412304 -1.920855

In [17]:
df.drop('New', axis=1, inplace=True)

In [18]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [19]:
df.loc['A']

W    0.496714
X   -0.138264
Y    0.647689
Z    1.523030
Name: A, dtype: float64

In [20]:
df.loc['B']

W   -0.234153
X   -0.234137
Y    1.579213
Z    0.767435
Name: B, dtype: float64

In [21]:
df.iloc[1]

W   -0.234153
X   -0.234137
Y    1.579213
Z    0.767435
Name: B, dtype: float64

In [22]:
df.loc[['A', 'C']]

          W         X         Y        Z
A  0.496714 -0.138264  0.647689  1.52303
C -0.469474  0.542560 -0.463418 -0.46573

In [23]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [24]:
df.loc[['A', 'B'], ['Y', 'Z']]

          Y         Z
A  0.647689  1.523030
B  1.579213  0.767435

In [25]:
df > 0

       W      X      Y      Z
A   True  False   True   True
B  False  False   True   True
C  False   True  False  False
D   True  False  False  False
E  False   True  False  False

In [26]:
df_bool = df > 0
df_bool

       W      X      Y      Z
A   True  False   True   True
B  False  False   True   True
C  False   True  False  False
D   True  False  False  False
E  False   True  False  False

In [27]:
df[df_bool]

          W         X         Y         Z
A  0.496714       NaN  0.647689  1.523030
B       NaN       NaN  1.579213  0.767435
C       NaN  0.542560       NaN       NaN
D  0.241962       NaN       NaN       NaN
E       NaN  0.314247       NaN       NaN

In [28]:
df[df < 0]

          W         X         Y         Z
A       NaN -0.138264       NaN       NaN
B -0.234153 -0.234137       NaN       NaN
C -0.469474       NaN -0.463418 -0.465730
D       NaN -1.913280 -1.724918 -0.562288
E -1.012831       NaN -0.908024 -1.412304

In [29]:
df['W'] > 0

A     True
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [30]:
df[df['W']>0]

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
D  0.241962 -1.913280 -1.724918 -0.562288

In [31]:
c1 = df['W'] < 0
c2 = df["W"] > 0

In [32]:
df[(c1) & (c2)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [33]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.496714 -0.138264  0.647689  1.523030
1     B -0.234153 -0.234137  1.579213  0.767435
2     C -0.469474  0.542560 -0.463418 -0.465730
3     D  0.241962 -1.913280 -1.724918 -0.562288
4     E -1.012831  0.314247 -0.908024 -1.412304

In [34]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [35]:
new_idx = 'CA NY WY OR CO'.split()

In [36]:
df["States"] = new_idx

In [37]:
df

          W         X         Y         Z States
A  0.496714 -0.138264  0.647689  1.523030     CA
B -0.234153 -0.234137  1.579213  0.767435     NY
C -0.469474  0.542560 -0.463418 -0.465730     WY
D  0.241962 -1.913280 -1.724918 -0.562288     OR
E -1.012831  0.314247 -0.908024 -1.412304     CO

In [38]:
df.set_index("States", inplace=True)

In [39]:
df

               W         X         Y         Z
States
CA      0.496714 -0.138264  0.647689  1.523030
NY     -0.234153 -0.234137  1.579213  0.767435
WY     -0.469474  0.542560 -0.463418 -0.465730
OR      0.241962 -1.913280 -1.724918 -0.562288
CO     -1.012831  0.314247 -0.908024 -1.412304

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [41]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [42]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.195556 -0.285775 -0.173892 -0.029971
std    0.594794  0.964283  1.301617  1.165307
min   -1.012831 -1.913280 -1.724918 -1.412304
25%   -0.469474 -0.234137 -0.908024 -0.562288
50%   -0.234153 -0.138264 -0.463418 -0.465730
75%    0.241962  0.314247  0.647689  0.767435
max    0.496714  0.542560  1.579213  1.523030

In [43]:
df['W'] > 0

States
CA     True
NY    False
WY    False
OR     True
CO    False
Name: W, dtype: bool

In [44]:
ser_w = df['W'] > 0 
ser_w.count()

5

In [45]:
sum(ser_w)

2

In [57]:
data = {
    'Company':['GooG','GOOG','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
    'Salas':[200,120,340,124,243,350]
}

In [58]:
data

{'Company': ['GooG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Salas': [200, 120, 340, 124, 243, 350]}

In [59]:
df = pd.DataFrame(data)
df

  Company   Person  Salas
0    GooG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [60]:
df.groupby('Company')

In [61]:
df.groupby('Company').sum()

             Person  Salas
Company
FB        CarlSarah    593
GOOG        Charlie    120
GooG            Sam    200
MSFT     AmyVanessa    464

In [64]:
df.groupby('Company').describe().transpose()

Company              FB   GOOG   GooG        MSFT
Salas count    2.000000    1.0    1.0    2.000000
      mean   296.500000  120.0  200.0  232.000000
      std     75.660426    NaN    NaN  152.735065
      min    243.000000  120.0  200.0  124.000000
      25%    269.750000  120.0  200.0  178.000000
      50%    296.500000  120.0  200.0  232.000000
      75%    323.250000  120.0  200.0  286.000000
      max    350.000000  120.0  200.0  340.000000

In [65]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [67]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [68]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [70]:
newDf = df[ (df['col1']>2) & (df['col2']==444)]
newDf

   col1  col2 col3
3     4   444  xyz

In [80]:
def times_two(number):
    return number+2

In [81]:
df['new']=df['col1'].apply(times_two)
df

   col1  col2 col3  new
0     1   444  abc    3
1     2   555  def    4
2     3   666  ghi    5
3     4   444  xyz    6

In [83]:
del df['new']
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz